# SQLite

Beispiel mit SQLite, ohne Server

In [1]:
%load_ext sql
%sql sqlite://

'Connected: None@None'

In [2]:
%%sql
CREATE TABLE writer (first_name, last_name, year_of_death);
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Bertold', 'Brecht', 1956);

Done.
1 rows affected.
1 rows affected.

[]

In [3]:
%sql select * from writer

Done.

[(u'William', u'Shakespeare', 1616), (u'Bertold', u'Brecht', 1956)]

#Mit MySQL

Voraussetzung, der MySQL Server l√§uft!

In [6]:
%sql mysql://tester:test@localhost/test_db

u'Connected: tester@test_db'

In [12]:
%%sql
CREATE TABLE `test_db`.`writer` (`first_name` VARCHAR(30) NOT NULL,`last_name` VARCHAR(45) NULL,
                                 `year_of_death` DATETIME NULL, PRIMARY KEY (`first_name`));
INSERT INTO writer VALUES ('William', 'Shakespeare', '1616');
INSERT INTO writer VALUES ('Bertold', 'Brecht', '1956');

0 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%sql select * from `test_db`.`writer`;

2 rows affected.

[('Bertold', 'Brecht', None), ('William', 'Shakespeare', None)]

In [15]:
%sql DROP TABLE `test_db`.`writer`

(_mysql_exceptions.OperationalError) (1142, "DROP command denied to user 'tester'@'localhost' for table 'writer'") [SQL: u'DROP TABLE `test_db`.`writer`']